/*
Задание 3.
Тимур каждый день недели ест булочки из столовой. Чтобы отслеживать количество съеденных булочек, он хочет фиксировать данные в массиве. Напишите программу, которая заполняет с клавиатуры массив целыми числами: каждое число характеризует количество съеденных булочек в день. Выведите на экран с соответствующими комментариями:
А) Номер дня, в который он съел больше всего булочек. Если таких дней несколько, выведите номер первого из них.
Б) Количество дней, когда он съел менее двух булочек.
В) Количество дней, когда он съел больше 10 булочек.
Г) Общее количество съеденных булочек за неделю.
Д) Среднее количество булочек за неделю.
Е) Если есть день, когда он всё-таки не съел ни одной булочки, выведите сообщение «Теряешь хватку!».
*/

public static class Task3
{
    public static void Run()
    {
        byte[] week = new byte[7];
        byte max = 0;
        byte max_index = 0;
        for (byte i = 0; i < week.Length; i++)
        {
            Console.Write($"Введите, сколько булочек съел Тимур в день {i+1}: ");
            week[i] = byte.Parse(Console.ReadLine());
            if (week[i] > max) {max = week[i]; max_index = i;}
        }
        Console.WriteLine($"В день {max_index+1} Тимур съел больше всего булочек - {max}.");
        byte count_less_than_two = 0;
        byte count_more_than_ten = 0;
        ushort total = 0;
        foreach (byte elem in week)
        { 
            total += elem;
            if (elem < 2) {count_less_than_two ++;}
            else if (elem > 10) {count_more_than_ten ++;}
            if (elem == 0) Console.WriteLine("Теряешь хватку!");
        }
        Console.WriteLine($"Количество дней, когда Тимур съел меньше двух булочек: {count_less_than_two}");
        Console.WriteLine($"Количество дней, когда Тимур съел больше десяти булочек: {count_more_than_ten}");
        Console.WriteLine($"Общее количество съеденных булочек за неделю: {total}");
        Console.WriteLine($"Среднее количество булочек за неделю: {(float)total/week.Length}");
    }
}