/*
Задание 2.
Создайте массив, который содержит фамилии работников (количество фамилий определите сами, не менее пяти). Выведите на экран с соответствующими комментариями:
А) Количество фамилий в списке.
Б) Самую длинную фамилию. Если есть фамилии с одинаковым количество символов (с одинаковой длиной), выведите любую одну.
В) Первую фамилию в массиве.
Г) Фамилии, стоящие на чётных местах (i=0,2,4,6,...).
*/

public static class Task2
{
    public static void Run()
    {
        string[] members = ["Абрикосов", "Баранова", "Волгин", "Гусева", "Демидов"];
        Console.WriteLine($"Количество фамилий в списке: {members.Length}");
        Console.WriteLine($"Самая длинная фамилия в списке: {members.MaxBy(l => l.Length)}");
        Console.WriteLine($"Первая фамилия в списке: {members[0]}");
        Console.Write("Фамилии, стоящие на чётных местах в списке: ");
        for (byte i = 0; i < members.Length; i+=2) Console.Write(members[i] + ", ");
    }
}